{
  "jobs": [
    {
      "title": "JP Morgan & Chase",
      "role": "Software Developer",
      "imgSrc": "jp morgan.jpeg",
      "startDate": "2023-08-01",
      "skills": ["React", "Python"],
      "details": [
        "Leading transtition to internal monitoring tool for cost reduction and better perfomence.",
        "Collaborating closely with the SRE team to enhance monitoring of the microservices.",
        "Enhanced monitoring for 10+ microservices by instrumenting distributed tracing.",
        "Migrated 650+ jobs to newer server for better performace.",
        "Handling production support and resolving production incidents."
      ]
    },
    {
      "title": "JP Morgan & Chase",
      "role": "Software Developer Intern",
      "imgSrc": "jp morgan.jpeg",
      "startDate": "2022-06-01",
      "endDate": "2022-07-31",
      "skills": ["React", "Python"],
      "details": [
        "Enhanced data availability and search result analysis by developing an incident investigation tool.",
        "Built data availability tool using react and python reducing investigation time for 5 teams.",
        "Migrated legacy tool from ASP to React, enhancing investigation experience for two teams.",
        "Presented data availability tool to PM and AD teams, highlighting their use cases and functionality."
      ]
    },
    {
      "title": "TCET Opensource",
      "role": "Volunteering : Backend Lead",
      "imgSrc": "erp.png",
      "startDate": "2023-02-01",
      "endDate": "2023-07-31",
      "skills": ["Node", "Express", "Git", "Github", "Team Mangement"],
      "details": [
        "Lead a team of 12 backend develpers",
        "Conducted multiple workshops and sessions on VCS and backend technoloies.",
        "Spearheaded the planning, design, and development of a comprehensive ERP system for the College.",
        "Engineered an adaptable system aligned with the new education policy, ensuring backward data compatibility.",
        "Created resilient system for 10K concurrent users support",
        "Authored wiki pages or detailed documentation to streamline implementation and maintenance processes.",
        "Efficiently managed projects using Github, meticulously tracking progress for timely and successful completion."
      ]
    },
    {
      "title": "GDSC",
      "role": "Volunteering : Team Lead",
      "imgSrc": "gdsc.png",
      "startDate": "2021-07-01",
      "endDate": "2022-07-01",
      "skills": [
        "Team Mangement",
        "Public speaking",
        "Event planning",
        "Budgeting"
      ],
      "details": [
        "Pioneered the campus's first technical community, fostering a collaborative learning environment.",
        "Lead a team of 20+ students.",
        "Increased community size from 0 to 1000 in a year.",
        "Handled communitcations across different stakeholders.",
        "Orchestrated workshops on cutting-edge topics, including Cloud, AI/ML, and conducted a comprehensive series on Docker.",
        "Successfully organized the inaugural college hackathon, promoting innovation and collaboration  among students.",
        "Proactively nurtured a culture of technical engagement, providing support, resources, and platforms for student development."
      ]
    },
    {
      "title": "Esamyak",
      "role": "Software Developer Intern",
      "imgSrc": "esamyak.jpeg",
      "startDate": "2021-07-01",
      "endDate": "2021-08-31",
      "skills": ["JAVA", "SpringBoot", "Git"],
      "details": [
        "Worked as backend intern.",
        "As intern setup Springboot environment.",
        "Created a sample REST API using JAVA SpringBoot.",
        "Created middleware to check if user has JWT token or not."
      ]
    }
  ]
}
